app/controllers/customers_controller.rb

    def create
        @customer = Customer.new(customer_params)
        if @customer.save
---
INSERT INTO `customers` (`email`, `password_digest`, `created_at`, `updated_at`) VALUES ('austin@email.com', '$2a$10$.NFYBeXbUPIjlYJe7VtY1eP2fBEiLAJEAVBrOFW.2CgNBH6EGT5YS', '2017-11-15 17:19:54', '2017-11-15 17:19:54')

    def index
        @customers = Customer.all
---
SELECT `customers`.* FROM `customers`

    def show
        @customer = Customer.find(params[:id])
---
SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = NULL LIMIT 1

    def edit
        @customer = Customer.find(params[:id])
---
SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 9 LIMIT 1

    def update
        @customer = Customer.find(params[:id])
        if @customer.update(customer_info_params)
---
SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 12 LIMIT 1
UPDATE `customers` SET `first_name` = 'Test', `last_name` = 'test', `street_address` = '123 test', `city` = 'Nashville', `state` = 'Tennessee', `zip` = 12345, `phone_number` = '434576', `updated_at` = '2017-11-15 21:28:15' WHERE `customers`.`id` = 17