app/controllers/pay_methods_controller.rb

    def index
        @pay_methods = PayMethod.all
---
SELECT `pay_methods`.* FROM `pay_methods`