app/controllers/pay_methods_controller.rb

    def index
        @pay_methods = PayMethod.where(:customer_id => session[:user_id], active_record: true)
---
SELECT `pay_methods`.* FROM `pay_methods` WHERE `pay_methods`.`customer_id` = 30 AND `pay_methods`.`active_record` = 1

    def create
        @pay_method = PayMethod.new(pay_method_params)
        @pay_method.customer_id = session[:user_id]
        @pay_method.active_record = 1
        if @pay_method.save
---
INSERT INTO `pay_methods` (`payment_type`, `account_number`, `expiration_date`, `customer_id`, `created_at`, `updated_at`, `active_record`) VALUES ('Visa', '0987654321123456', '2020-11-01', 30, '2017-11-20 21:29:01', '2017-11-20 21:29:01', 1)

    def show
        @pay_method = PayMethod.find(params[:id])
---
SELECT  `pay_methods`.* FROM `pay_methods` WHERE `pay_methods`.`id` = 1 LIMIT 1

    def destroy
        @pay_method = PayMethod.find(params[:id])
        @pay_method.active_record = 0
        if @pay_method.save
---
SELECT  `pay_methods`.* FROM `pay_methods` WHERE `pay_methods`.`id` = 17 LIMIT 1
UPDATE `pay_methods` SET `active_record` = 0, `updated_at` = '2017-11-20 21:27:06' WHERE `pay_methods`.`id` = 17