app/controllers/products_controller.rb

  def new
    @product = Product.new
    @photo = Photo.new
    @product_type = ProductType.all
---
SELECT  `product_types`.* FROM `product_types` ORDER BY `product_types`.`id` ASC LIMIT 1

  def create
    @product = Product.new(product_params)
    @product.customer_id = session[:user_id]
    @product.product_added = DateTime.now()
    @product.active = 1
    if @product.save
      if params[:images]
        params[:images].each { |image|
        @product.photos.create(image: image)
      }
      end
      redirect_to product_path(@product)
    else
      @product_type = ProductType.all
---
INSERT INTO `products` (`customer_id`, `product_type_id`, `product_name`, `product_price`, `product_desc`, `quantity`, `product_added`, `local_delivery`, `created_at`, `updated_at`) VALUES (2, 2, 'test 16', 5.78, 'test desc 16', 3, '2017-11-17 17:53:41', 1, '2017-11-17 17:53:41', '2017-11-17 17:53:41')
INSERT INTO `images` (`created_at`, `updated_at`) VALUES ('2017-11-16 21:59:26', '2017-11-16 21:59:26')
SELECT `product_types`.* FROM `product_types`

  def show
      @product = Product.find(params[:id])
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1

  def showSellerProduct
      @products = Product.where(:customer_id => session[:user_id], active: true)
---
SELECT `products`.* FROM `products` WHERE `products`.`customer_id` = 1 AND `products`.`active` = 1

  def index
    @products = if params[:product]
      Product.where("product_name like ?", "%#{params[:product]}%")
    else
      @products = Product.all
---
SELECT `products`.* FROM `products` WHERE (product_name like '%as%')
SELECT `products`.* FROM `products`

  def categories
    @categories = ProductType.all
    @product_info = Product.all
---
SELECT `product_types`.* FROM `product_types`
SELECT `products`.* FROM `products`