app/controllers/sessions_controller.rb

SELECT  `customers`.* FROM `customers` WHERE `customers`.`email` = 'asdfxcv@sd.com' LIMIT 1
---
    def create
      customer = Customer.find_by(email: params[:email])