app/views/products/_form.html.erb

SELECT  `product_types`.* FROM `product_types` ORDER BY `product_types`.`id` ASC LIMIT 1
---
      <%= form.label "Product Category" %><br>
      <%= form.collection_select(:product_type_id, ProductType.all, :id, :product_type_name) %>