app/views/products/categories.html.erb

        <% if type.id == prod.product_type_id  %>
            <%= prod.product_name.count %>
---
SELECT SUM() AS sum, `products`.`product_name` AS products_product_name FROM `products` GROUP BY `products`.`product_name`
SELECT `products`.* FROM `products`